'use strict';

/*var - существует везде
let - существует только тогда, когда код до нее доходит*/

alert('Hello World');
prompt('hey');

// +prompt - строку в число
// let incr = 10, decr = 26 - в переменной можно перечислять через запятую

// incr++ 
// decr-- - увеличить или уменьшить на единицу

// ++incr - префиксная форма, вернет то, что уже было = 11
// incr++ постфиксная форма возвращает занчение, которое было до перфиксной формы = 10

// % - выведет остаток от деления

// && - логический оператор И. Когда все аргументы являются true

// || - оператор ИЛИ. Когда хотя бы один из аргументов является true

// ! - оператор отрицания. Который обращает значение в обратное - правду в ложь и наоборот

// ы